#+TITLE: 課題02
#+DATE: 2026-02-16

#+BEGIN_SRC jupyter-python :session py :async yes
tax = 0.1
postage = 350
value = int(input("税抜価格を入力してください："))
valueInTax = float(value) * (1.0 + tax)

if 2000.0 <= valueInTax:
  print("送料は無料です")
else:
  print(f"送料は{postage}円です")

print(f"送料込税込価格は{int(valueInTax) + postage}円です")
#+END_SRC

#+RESULTS:
: 送料は無料です
: 送料込税込価格は2548円です
